10/data/attachments/b9c4cdd49c6f573d.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_9ea7829f-6e42-42c6-bed8-bc3abca5e30d</nif:username>
            <nif:friendToBeAdded>James_throughout_Friend_55036_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>